'''
Підрахувати кількість об’єктів на обраному цифровому зображенні:
біла полиця на білій стіні з кольоровими фігурками.

Об’єкти, що підлягають обрахунку - фігурки.
Фон поза фігурками - біла полиця та сіра тінь від полиці, що може вплинути на якість детекції.

Зміст етапів попередньої обробки зображень
(корекція кольору, фільтрація, векторизація, кластеризація) має буди результатом R&D
процесів, що конкретизується обраним зображенням і об’єктами для підрахунку. Провести
аналіз отриманих результатів, сформувати висновки.
'''
import cv2
import matplotlib.pyplot as plt


def preprocess_image(image):

    return image


if __name__ == "__main__":
    image = cv2.imread('img_task3.png')
    if image is None:
        print("Помилка: не вдалося завантажити зображення. Перевірте шлях до файлу.")
        exit(1)

    image_rgb = cv2.cvtColor(image, cv2.COLOR_BGR2RGB)

    fig_size = (8, 5)
    plt.figure(figsize=fig_size)
    plt.title('Оригінал')
    plt.imshow(image_rgb)
    plt.axis('off')
    plt.show()
